Taxi/test_billing_fin_payouts/stq/static/test_create_payments/test_data.json

{
  "expected_payment_event_log": [
    {
      "amount": "1500.00",
      "amount_applied": "0",
      "external_payment_id": null,
      "id": 1,
      "idempotency_key": "NEW",
      "payment_id": 1,
      "status": "NEW",
      "updates": {
        "payment_group": "PAYMENT",
        "pro_payload": {
          "pro_category_id": "PAYMENT_ORDER",
          "pro_order_id": "6d5144addb183c86acee401124cb2c1f"
        }
      }
    },
    {
      "amount": "1100.00",
      "amount_applied": "0",
      "external_payment_id": null,
      "id": 2,
      "idempotency_key": "NEW",
      "payment_id": 2,
      "status": "NEW",
      "updates": {
        "account": "ЛСТ-1234567",
        "payment_group": "REVENUE",
        "pro_payload": {
          "pro_category_id": "PAYMENT_REQUIREMENT",
          "pro_order_id": "6d5144addb183c86acee401124cb2c1f"
        }
      }
    }
  ],
  "expected_payments": [
    {
      "amount": "1500.00",
      "client_id": "1349515601",
      "contract_id": "3697999",
      "currency": "RUB",
      "dry_run": false,
      "firm_id": 98765,
      "id": 1,
      "payment_processor": "YA_BANK",
      "payment_type": "PAYMENT_ORDER",
      "person_id": "123",
      "source_id": "c4ca4238a0b923820dcc509a6f75849b",
      "source_type": "TAXI"
    },
    {
      "amount": "1100.00",
      "client_id": "1349515601",
      "contract_id": "3697999",
      "currency": "RUB",
      "dry_run": false,
      "firm_id": 98765,
      "id": 2,
      "payment_processor": "YA_BANK",
      "payment_type": "PAYMENT_REQUIREMENT",
      "person_id": "123",
      "source_id": "c81e728d9d4c2f636f067f89cc14862c",
      "source_type": "TAXI"
    }
  ],
  "expected_payout_event_log": [
    {
      "id": 1,
      "idempotency_key": "1/NEW",
      "payment_id": null,
      "payout_id": 1,
      "status": "NEW"
    },
    {
      "id": 2,
      "idempotency_key": "2/NEW",
      "payment_id": null,
      "payout_id": 2,
      "status": "NEW"
    },
    {
      "id": 3,
      "idempotency_key": "3/NEW",
      "payment_id": null,
      "payout_id": 3,
      "status": "NEW"
    },
    {
      "id": 4,
      "idempotency_key": "3/PROCESSED",
      "payment_id": 123456,
      "payout_id": 3,
      "status": "PROCESSED"
    },
    {
      "id": 5,
      "idempotency_key": "1/PROCESSED",
      "payment_id": 1,
      "payout_id": 1,
      "status": "PROCESSED"
    },
    {
      "id": 6,
      "idempotency_key": "2/PROCESSED",
      "payment_id": 2,
      "payout_id": 2,
      "status": "PROCESSED"
    }
  ],
  "expected_stq_calls": [
    {
      "args": [
        1
      ],
      "eta": "1970-01-01T00:00:00.000000+00:00",
      "kwargs": {},
      "task_id": "payment_id/1"
    },
    {
      "args": [
        2
      ],
      "eta": "1970-01-01T00:00:00.000000+00:00",
      "kwargs": {},
      "task_id": "payment_id/2"
    }
  ]
}
